<?php
/*

 Инкапсуляция в первую очередь это размещение логически схожих данных, функций в одну структуру(Оболочку, капсулу, класс)
 * , сокрытие данных от внешнего вмешательства(в том числе с целью защиты)
 *  
 * 
Минусы ооп
 * Необходимость четкого описания класса и хорошего проектирования, создание грамотного 
 * взаимодействия обьектов, в ином случае никаких плюсов от ООП не будет.
 * 
 * Плюсы опп
 * Абстрагирование от "ключей, значений, массивов" и возможность мыслить более логичными понятиями
 * собаками, машинами.... и не заботиться как там все устроенно внутри.
 * более легкое масштабирование кода при добавлении нового функционала
 * Уменьшение размера кода
 * 
 *  
 * 
 * 
*/

?>